<a href="https://colab.research.google.com/github/Hbada/Python-data-analysis-lessons-notebooks/blob/master/Pandas_practice_notebook.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
# original notebook source: Google Colab
# exercise sources: Udemy course Python for Data Science... by Portilla
import numpy as np
import pandas as pd

## Create series

In [0]:
# create lists of data
labels = ['a', 'b', 'c']
my_data = [10, 20, 30]

In [4]:
# create initial array
arr = np.array(my_data)
arr

array([10, 20, 30])

In [0]:
# create dictionary
d = {'a':10, 'b':20, 'c':30} # Python way to combine index with values

In [6]:
# create series
pd.Series(data = my_data)

0    10
1    20
2    30
dtype: int64

In [7]:
# create new series with an index
pd.Series(data=my_data, index=labels) # series use labels to denote indexes

a    10
b    20
c    30
dtype: int64

In [8]:
# shortcut to create series with index
pd.Series(my_data, labels)

a    10
b    20
c    30
dtype: int64

In [9]:
# create series from any numpy array
zeroes = np.zeros(9)
pd.Series(zeroes)
# can't use .reshape(3,3) yet because .Series() requires 1D array

0    0.0
1    0.0
2    0.0
3    0.0
4    0.0
5    0.0
6    0.0
7    0.0
8    0.0
dtype: float64

In [10]:
# turn dictionary into series
pd.Series(d)
# automatically converts dictionary keys to index in the series

a    10
b    20
c    30
dtype: int64

In [11]:
# create series of strings
pd.Series(labels)
# index is automatically created, and labels array becomes the values

0    a
1    b
2    c
dtype: object

In [12]:
# can also create series holding other object types
pd.Series(data=[sum,len]) # series of functions

0    <built-in function sum>
1    <built-in function len>
dtype: object

## Using index in a series

In [13]:
# create two series with values then labels
ser1 = pd.Series([1, 2, 3, 4], ['Japan', 'Morocco', 'Canada', 'England'])
ser1

Japan      1
Morocco    2
Canada     3
England    4
dtype: int64

In [14]:
ser2 = pd.Series([1, 5, 3, 4], ['Japan', 'Italy', 'Canada', 'England'])
ser2

Japan      1
Italy      5
Canada     3
England    4
dtype: int64

In [15]:
# retrieve by label as index
ser2['Italy']

5

In [16]:
# see how indexes line up; add two series
ser1 + ser2 # integers become floats automatically so you don't lose info

Canada     6.0
England    8.0
Italy      NaN
Japan      2.0
Morocco    NaN
dtype: float64

## Create data frame

In [0]:
from numpy.random import randn
np.random.seed(101) # set a seed to match the course instructor's results

In [18]:
# create table of random normal distribution numbers in 5 rows, 4 columns
df = pd.DataFrame(randn(5, 4))
df

          0         1         2         3
0  2.706850  0.628133  0.907969  0.503826
1  0.651118 -0.319318 -0.848077  0.605965
2 -2.018168  0.740122  0.528813 -0.589001
3  0.188695 -0.758872 -0.933237  0.955057
4  0.190794  1.978757  2.605967  0.683509

In [19]:
# create same table but with labels
df = pd.DataFrame(randn(5, 4), ['A', 'B', 'C', 'D', 'E'], ['Apples', 'Oranges', 'Bananas', 'Mangos'])
df

     Apples   Oranges   Bananas    Mangos
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

## Select portions of a dataframe

In [20]:
# select one column only
df['Apples']

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: Apples, dtype: float64

In [21]:
# confirm that a column is considered a series
type(df['Apples'])

pandas.core.series.Series

In [22]:
# select multiple columns by inserting a list as index
df[['Apples', 'Mangos']]

     Apples    Mangos
A  0.302665 -1.159119
B -0.134841  0.184502
C  0.807706  0.329646
D -0.497104  0.484752
E -0.116773  1.996652

In [23]:
# confirm that a multi-column selection is not a series, but rather a df
type(df[['Apples', 'Mangos']])

pandas.core.frame.DataFrame

In [24]:
# select a row using .loc method
df.loc['B']
# returns a series

Apples    -0.134841
Oranges    0.390528
Bananas    0.166905
Mangos     0.184502
Name: B, dtype: float64

In [25]:
# select a row using index location .iloc method
df.iloc[3] # returns row 4

Apples    -0.497104
Oranges   -0.754070
Bananas   -0.943406
Mangos     0.484752
Name: D, dtype: float64

In [26]:
# select a cell given a row and column
df.loc['B', 'Oranges']

0.39052784273374097

In [27]:
# display current df
df

     Apples   Oranges   Bananas    Mangos
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [28]:
# select a bunch of cells given a few rows and few columns to include
df.loc[['B', 'C'], ['Bananas', 'Mangos']]

    Bananas    Mangos
B  0.166905  0.184502
C  0.638787  0.329646

## Add and remove columns and rows

In [29]:
# add a column to df, in the context of a column operation
df['Sum'] = df['Apples'] + df['Oranges'] + df['Bananas'] + df['Mangos'] # sum column is new and contains sums
df

     Apples   Oranges   Bananas    Mangos       Sum
A  0.302665  1.693723 -1.706086 -1.159119 -0.868817
B -0.134841  0.390528  0.166905  0.184502  0.607094
C  0.807706  0.072960  0.638787  0.329646  1.849099
D -0.497104 -0.754070 -0.943406  0.484752 -1.709828
E -0.116773  1.901755  0.238127  1.996652  4.019761

In [30]:
# remove a column; requires axis=1 to specify it's a column
df.drop('Bananas', axis=1)

# notice the sum hasn't changed

     Apples   Oranges    Mangos       Sum
A  0.302665  1.693723 -1.159119 -0.868817
B -0.134841  0.390528  0.184502  0.607094
C  0.807706  0.072960  0.329646  1.849099
D -0.497104 -0.754070  0.484752 -1.709828
E -0.116773  1.901755  1.996652  4.019761

In [31]:
# confirm Bananas column still exists
df

     Apples   Oranges   Bananas    Mangos       Sum
A  0.302665  1.693723 -1.706086 -1.159119 -0.868817
B -0.134841  0.390528  0.166905  0.184502  0.607094
C  0.807706  0.072960  0.638787  0.329646  1.849099
D -0.497104 -0.754070 -0.943406  0.484752 -1.709828
E -0.116773  1.901755  0.238127  1.996652  4.019761

In [32]:
# delete column for real
df.drop('Bananas', axis=1, inplace=True)
# also delete Sum column since it was calculated on a previous columns
df.drop('Sum', axis=1, inplace=True)
df

     Apples   Oranges    Mangos
A  0.302665  1.693723 -1.159119
B -0.134841  0.390528  0.184502
C  0.807706  0.072960  0.329646
D -0.497104 -0.754070  0.484752
E -0.116773  1.901755  1.996652

In [33]:
# drop rows
df.drop('E', axis=0) # axis=0 can be omitted because it's the default value

     Apples   Oranges    Mangos
A  0.302665  1.693723 -1.159119
B -0.134841  0.390528  0.184502
C  0.807706  0.072960  0.329646
D -0.497104 -0.754070  0.484752

In [34]:
# notice it still has row E
df

     Apples   Oranges    Mangos
A  0.302665  1.693723 -1.159119
B -0.134841  0.390528  0.184502
C  0.807706  0.072960  0.329646
D -0.497104 -0.754070  0.484752
E -0.116773  1.901755  1.996652

In [35]:
# delete a row for real
df.drop('E', axis=0, inplace=True)
df

     Apples   Oranges    Mangos
A  0.302665  1.693723 -1.159119
B -0.134841  0.390528  0.184502
C  0.807706  0.072960  0.329646
D -0.497104 -0.754070  0.484752

## Shape of dataframe

In [36]:
# retrieve shape of dataframe, in (rows, columns)
# this is why axis=0 refers to rows and axis=1 refers to columns above
df.shape

(4, 3)

## Conditional selection

In [40]:
# return boolean for whether cell > 0
booldf = df > 0
booldf

   Apples  Oranges  Mangos
A    True     True   False
B   False     True    True
C    True     True    True
D   False    False    True

In [41]:
# cells that are True return a value; False give null result
df[booldf]

     Apples   Oranges    Mangos
A  0.302665  1.693723       NaN
B       NaN  0.390528  0.184502
C  0.807706  0.072960  0.329646
D       NaN       NaN  0.484752

In [42]:
# shortcut to df of a condition
df[df > 0]

     Apples   Oranges    Mangos
A  0.302665  1.693723       NaN
B       NaN  0.390528  0.184502
C  0.807706  0.072960  0.329646
D       NaN       NaN  0.484752

In [43]:
# note df as a variable still exists
df

     Apples   Oranges    Mangos
A  0.302665  1.693723 -1.159119
B -0.134841  0.390528  0.184502
C  0.807706  0.072960  0.329646
D -0.497104 -0.754070  0.484752

In [44]:
# find all positives in a column
df['Apples'] > 0 # returns a series

A     True
B    False
C     True
D    False
Name: Apples, dtype: bool

In [45]:
# select all rows that have True condition in Apples column
df[df['Apples'] > 0]

     Apples   Oranges    Mangos
A  0.302665  1.693723 -1.159119
C  0.807706  0.072960  0.329646

In [46]:
# selections based on the results of the condition
# save the conditional selection to a variable
resultdf = df[df['Apples'] > 0]
# select one column of the results
resultdf['Oranges'] # all the Oranges values, for rows with positive Apples values

A    1.693723
C    0.072960
Name: Oranges, dtype: float64

In [47]:
# shortcut for prior cell
df[df['Apples'] > 0]['Oranges']

A    1.693723
C    0.072960
Name: Oranges, dtype: float64